STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_PBP_Sink/Core/Src/app_entry.c
#if (CFG_JOYSTICK_SUPPORTED == 1)
static void Joystick_Init( uint8_t wkup_mode )
{
  if (wkup_mode == 1)
  {
    /* configuration as a WKUP Pin */
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin       = JOY1_CHANNEL_GPIO_PIN;
    GPIO_InitStruct.Mode      = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(JOY1_CHANNEL_GPIO_PORT, &GPIO_InitStruct);

    HAL_NVIC_SetPriority(EXTI1_IRQn, 15, 0);
    HAL_NVIC_EnableIRQ(EXTI1_IRQn);
  }
  else
  {
    BSP_JOY_Init(JOY1, JOY_MODE_POLLING, JOY_ALL);
    /* reconfiguration of the ADC4 interrupt priority */
    HAL_NVIC_DisableIRQ(ADC4_IRQn);
    HAL_NVIC_SetPriority(ADC4_IRQn, 15, 0);
    HAL_NVIC_EnableIRQ(ADC4_IRQn);
  }
}

static void Joystick_TimerCallback(void *arg)
{
  UTIL_SEQ_SetTask( 1U << CFG_TASK_JOYSTICK_ID, CFG_SEQ_PRIO_0);
}

static void Joystick_ActionHandle(void)
{
  /* Joystick reinitialization */
  Joystick_Init(0);

  int32_t state = BSP_JOY_GetState(JOY1);

  BSP_JOY_DeInit(JOY1, JOY_ALL);

  /* process Joystick information */
  if (state != JOY_NONE && state != Joystick_Prev_State)
  {
    if (state == JOY_SEL)
    {
    }
    else if ((state == JOY_UP) || (state == JOY_RIGHT))
    {
      uint32_t source_id;
      uint8_t source_id_string[17] = "sink ID 0xXXXXXX";
      PBPAPP_SwitchBrdSource(1, &source_id);
  #if (CFG_LCD_SUPPORTED == 1)
      BSP_SPI3_Init();
      /*reset the string line with black*/
      UTIL_LCD_FillRect(0,5+12+2,128,12,SSD1315_COLOR_BLACK);

      SourceIDToString(source_id, &(source_id_string[10]));

      UTIL_LCD_DisplayStringAt(0, 5+12+2, source_id_string, CENTER_MODE);
      BSP_LCD_Refresh(0);
      BSP_SPI3_DeInit();
  #endif /* (CFG_LCD_SUPPORTED == 1) */
    }
    else if ((state == JOY_DOWN) || (state == JOY_LEFT))
    {
      uint32_t source_id;
      uint8_t source_id_string[17] = "sink ID 0xXXXXXX";
      PBPAPP_SwitchBrdSource(0, &source_id);
  #if (CFG_LCD_SUPPORTED == 1)
      BSP_SPI3_Init();
      /*reset the string line with black*/
      UTIL_LCD_FillRect(0,5+12+2,128,12,SSD1315_COLOR_BLACK);

      SourceIDToString(source_id, &(source_id_string[10]));

      UTIL_LCD_DisplayStringAt(0, 5+12+2, source_id_string, CENTER_MODE);
      BSP_LCD_Refresh(0);
      BSP_SPI3_DeInit();
  #endif /* (CFG_LCD_SUPPORTED == 1) */
    }
  }

  Joystick_Prev_State = state;
}
#endif  /* CFG_JOYSTICK_SUPPORTED */

#if (CFG_LCD_SUPPORTED == 1)

static void LCD_Init( void )
{
  extern uint8_t wav_2[];
  uint32_t source_id;
  uint8_t source_id_string[17] = "sink ID 0xXXXXXX";
  /* BSP init LCD*/
  BSP_LCD_Init(0, LCD_ORIENTATION_LANDSCAPE);

  /* Set LCD Foreground Layer  */
  UTIL_LCD_SetFuncDriver(&LCD_Driver); /* SetFunc before setting device */
  UTIL_LCD_SetDevice(0);               /* SetDevice after funcDriver is set */

  BSP_LCD_DisplayOn(0);

  BSP_LCD_Clear(0,SSD1315_COLOR_BLACK);
  BSP_LCD_Refresh(0);

  /* Set the LCD Text Color */
  UTIL_LCD_SetFont(&Font12);
  UTIL_LCD_SetTextColor(SSD1315_COLOR_WHITE);
  UTIL_LCD_SetBackColor(SSD1315_COLOR_BLACK);
  BSP_LCD_Refresh(0);

  LCD_DrawBitmapArray(0 , 32, 128, 32, &wav_2[0]);

  mute = 1;
  DrawSpeakerState();

  UTIL_LCD_DisplayStringAt(0, 5, (uint8_t *)"AURACAST DEMO", CENTER_MODE);

  source_id = PBPAPP_GetBrdSource();
  SourceIDToString(source_id, &(source_id_string[10]));

  UTIL_LCD_DisplayStringAt(0, 5+12+2, source_id_string, CENTER_MODE);

  BSP_LCD_Refresh(0);

  /* release bus for power optimisation */
  BSP_SPI3_DeInit();
}

/* draw an array of bits at the specified offsets starting from corner top left. Ensure xlen is multiple of 8*/
static int32_t LCD_DrawBitmapArray(uint8_t xpos, uint8_t ypos, uint8_t xlen, uint8_t ylen, uint8_t *data){

  int32_t i,j,k;
  uint8_t mask;
  uint8_t* pdata = data;

  if (((xpos+xlen) > 128) || ((ypos+ylen) > 64))
  {
    /*out of screen*/
    return -1;
  }

  for (j=0 ; j < ylen ; j++)
  {
    for (i=0 ; i < xlen/8 ; i++)
    {
      mask = 0x80;
      for (k=0 ; k < 8 ; k++)
      {
        if ( mask & *pdata)
        {
          UTIL_LCD_SetPixel(i*8+k+xpos, j+ypos, SSD1315_COLOR_WHITE);
        }
        else
        {
          UTIL_LCD_SetPixel(i*8+k+xpos, j+ypos, SSD1315_COLOR_BLACK);
        }
        mask = mask >> 1;
      }
      pdata++;
    }
  }

  BSP_LCD_Refresh(0);

  return 0;
}

static void SourceIDToString(uint32_t SourceID, uint8_t *pString)
{
  uint8_t i;
  for (i = 0; i < 6; i++)
  {
    uint8_t digit = (SourceID >> ((5-i)*4)) & 0xF;
    if (digit < 0xA)
    {
      pString[i] = digit + 0x30;
    }
    else
    {
      pString[i] = digit + 0x37;
    }
  }
}
static void DrawSpeakerStateTask(void)
{
  BSP_SPI3_Init();
  DrawSpeakerState();
  BSP_SPI3_DeInit();
}

static void DrawSpeakerState(void)
{
  extern uint8_t volume_up[];
  extern uint8_t volume_mute[];
  uint8_t *pvolume;

  if (mute == 1)
  {
    /* Draw volume mute icon */
    pvolume = &volume_mute[0];
  }
  else
  {
    /* Draw volume up icon */
    pvolume = &volume_up[0];
  }

  LCD_DrawBitmapArray(108, 38, 16, 16, pvolume);
}
#endif  /* CFG_LCD_SUPPORTED */

/**
  * @brief Configure PLL for the audio frequency, PLL output is used for the SAI peripheral and as the core clock
  * @retval None
  */
void AudioClock_Init(uint32_t audio_frequency_type)
{
  uint32_t target_freq;
  if (audio_frequency_type == SAMPLE_FREQ_44100_HZ)
  {
    target_freq = 90316800;
  }
  else
  {
    /* valid for 8k, 16k, 24k, 32k or 48k */
    target_freq = 98304000;
  }

  if ( target_freq !=  PLL_Target_Clock_Freq )
  {
    scm_pll_config_t pll_config;
    LOG_INFO_APP("Audio Clock Initialization\n");

    pll_config.pll_mode = PLL_FRACTIONAL_MODE;
    pll_config.PLLM = 6;
    pll_config.PLLP = 4;
    pll_config.PLLQ = 4;
    pll_config.PLLR = 4;

    /* VCO frequency should be in range 128 to 544 MHz */
    /* PLL fractionnal should allows to cover +/-550ppm around the targeted frequency*/
    if (target_freq == 90316800)
    {
      pll_config.PLLN = 67;  /* VCO = HSE/M * N * (1 + Nfrac / 8192) < 32 / 6 * (67 + 1) = 362.7 MHz */
      pll_config.PLLFractional = 6042;
      pll_config.AHB5_PLL1_CLKDivider = LL_RCC_AHB5_DIV_3;
      /* PLLSYS = 90.31673 MHz */
    }
    else
    {
      pll_config.PLLN = 73;  /* VCO = HSE/M * N * (1 + Nfrac / 8192) < 32 / 6 * (73 + 1) = 394.7 MHz */
      pll_config.PLLFractional = 5964;
      pll_config.AHB5_PLL1_CLKDivider = LL_RCC_AHB5_DIV_4;
      /* PLLSYS = 98.30396 MHz */
    }

    UTIL_LPM_SetStopMode(1 << CFG_LPM_AUDIO, UTIL_LPM_DISABLE);

    scm_pll_setconfig(&pll_config);

    scm_setsystemclock(SCM_USER_APP, SYS_PLL);

    /* enable P output used for the audio timer */
    LL_RCC_PLL1_EnableDomain_PLL1P();

